In [5]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [47]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
df.columns = ['first_name', 'last_name', 'email']

In [8]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [10]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [11]:
df.loc[2, 'last']

'Doe'

In [12]:
df.loc[2, 'last'] = 'Smith'

In [13]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [15]:
df.at[2, 'last'] = 'Doe'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [17]:
filt = (df['email']=='JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [18]:
df['email'] = df['email'].str.lower()

In [19]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

## apply()

In [20]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [21]:
def update_email(email):
    return email.upper()

In [24]:
df['email'] = df['email'].apply(update_email)

In [25]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [26]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [27]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [28]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

## applymap()

In [29]:
df.applymap(len)

C:\Users\Owner\AppData\Local\Temp\ipykernel_18244\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [30]:
df.applymap(str.upper)

C:\Users\Owner\AppData\Local\Temp\ipykernel_18244\382839591.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.upper)

   first     last                    email
0  COREY  SCHAFER  COREYMSCHAFER@GMAIL.COM
1   JANE      DOE        JANEDOE@EMAIL.COM
2   JOHN    SMITH        JOHNDOE@EMAIL.COM

## map()

In [32]:
df['first'].map({'Corey': 'Hitesh', 'Jane': 'JannyB'})

0    Hitesh
1    JannyB
2       NaN
Name: first, dtype: object

## replace()

In [33]:
df['first'].replace({'Corey': 'Hitesh', 'Jane': 'JannyB'})

0    Hitesh
1    JannyB
2      John
Name: first, dtype: object

In [34]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [48]:
df['full_name'] = df['first'] + ' ' + df['last']

In [49]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [50]:
df.drop(columns=['first', 'last'], inplace=True)

In [51]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [53]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [54]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [55]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [58]:
new_row = pd.DataFrame([{'first': 'Tony'}])

# Append the new row using pd.concat
df = pd.concat([df, new_row], ignore_index=True)

In [59]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [60]:
people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Rogers'], 
    "email": ["stark@gmail.com", 'rogers@email.com']
}

df2 = pd.DataFrame(people)

In [61]:
df2

   first    last             email
0   Tony   Stark   stark@gmail.com
1  Steve  Rogers  rogers@email.com

In [62]:
pd.concat([df, df2], ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4          stark@gmail.com            NaN   Tony    Stark
5         rogers@email.com            NaN  Steve   Rogers

In [68]:
df = pd.concat([df, df2], ignore_index=True)

In [69]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN
4          stark@gmail.com            NaN   Tony    Stark
5         rogers@email.com            NaN  Steve   Rogers

In [71]:
df.drop(index=3)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
4          stark@gmail.com            NaN   Tony    Stark
5         rogers@email.com            NaN  Steve   Rogers

In [72]:
df.drop(index=df[df['last']=='Doe'].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3                      NaN            NaN   Tony      NaN
4          stark@gmail.com            NaN   Tony    Stark
5         rogers@email.com            NaN  Steve   Rogers